{
    "idioms": [
      {
        "title": "A blessing in disguise",
        "description": "A good thing that seemed bad at first.",
        "examples": [
          "Losing that job was a blessing in disguise — it led me to a better opportunity.",
          "Missing the flight turned out to be a blessing in disguise."
        ]
      },
      {
        "title": "Beat around the bush",
        "description": "Avoid saying what you really mean.",
        "examples": [
          "Stop beating around the bush and tell me what happened.",
          "He kept beating around the bush instead of giving a direct answer."
        ]
      },
      {
        "title": "Hit the sack",
        "description": "Go to sleep.",
        "examples": [
          "I'm really tired, I think I'll hit the sack.",
          "After the long day, she hit the sack early."
        ]
      },
      {
        "title": "Under the weather",
        "description": "Feeling ill or sick.",
        "examples": [
          "I'm feeling a bit under the weather today.",
          "He didn’t come to work because he was under the weather."
        ]
      },
      {
        "title": "Let the cat out of the bag",
        "description": "To reveal a secret unintentionally.",
        "examples": [
          "She let the cat out of the bag about the surprise party.",
          "He accidentally let the cat out of the bag."
        ]
      },
      {
        "title": "Cutting corners",
        "description": "Doing something poorly or cheaply to save time or money.",
        "examples": [
          "The builder was cutting corners and now the roof is leaking.",
          "Don't cut corners on this project — do it properly."
        ]
      },
      {
        "title": "Bite the bullet",
        "description": "To endure a painful or unpleasant situation that is unavoidable.",
        "examples": [
          "I hate going to the dentist, but I'll just have to bite the bullet.",
          "She decided to bite the bullet and start her own business."
        ]
      },
      {
        "title": "Bite off more than he can chew",
        "description": "To take on more responsibility than one can manage.",
        "examples": [
          "He bit off more than he could chew by accepting two jobs at once.",
          "Don't bite off more than you can chew — focus on one task at a time."
        ]
      },
      {
        "title": "Break the ice",
        "description": "To initiate conversation in a social setting to reduce tension or awkwardness.",
        "examples": [
          "He told a joke to break the ice at the meeting.",
          "It's always hard to break the ice at a new job."
        ]
      },
      {
        "title": "Speak of the devil",
        "description": "Said when someone mentioned appears unexpectedly.",
        "examples": [
          "Speak of the devil — we were just talking about you!",
          "Oh look, speak of the devil — there's John."
        ]
      },
      {
        "title": "Cost an arm and a leg",
        "description": "Very expensive or costly.",
        "examples": [
          "That new car cost me an arm and a leg.",
          "This designer bag costs an arm and a leg!"
        ]
      },
      {
        "title": "Once in a blue moon",
        "description": "Something that happens very rarely.",
        "examples": [
          "He only visits his hometown once in a blue moon.",
          "I eat junk food only once in a blue moon."
        ]
      },
      {
        "title": "On the same page",
        "description": "To agree or have the same understanding about something.",
        "examples": [
          "Before we start, I want to make sure we're on the same page.",
          "The team is finally on the same page about the project goals."
        ]
      },
      {
        "title": "Pull someone's leg",
        "description": "To joke or tease someone.",
        "examples": [
          "Relax, I was just pulling your leg!",
          "He said he won the lottery, but he was just pulling my leg."
        ]
      }
    ]
  }
   